### CREATING DATAFRAME



- df is a variable used to create a dataframe
- It is a tabular data structure i.e. it is all about rows and columns
- df contains the contents of given file
- read_csv takes path of csv file as input to import data
- We can also use a dictionary instead of using a csv file

###

1. Using df with a csv file

In [1]:
import pandas as pd
dic1 = {
    "Names": ["ishaan", "ravi", "raju"],
    "Address": ["12, ModelCol, Delhi, Haryana", "12, ModelCol, Delhi, Haryana", "12, ModelCol, Delhi, Haryana"]
}
df = pd.DataFrame(dic1)
m = list(df["Address"].values)
value = [[], [], [], []]
for i in m:
    l = i.split(",")
    ind = 0
    for j in l:
        value[ind].append(j)
        ind += 1
df["house"] = value[0]
df["colony"] = value[1]
df["city"] = value[2]
df["state"] = value[3]

df

    Names                       Address house     colony    city     state
0  ishaan  12, ModelCol, Delhi, Haryana    12   ModelCol   Delhi   Haryana
1    ravi  12, ModelCol, Delhi, Haryana    12   ModelCol   Delhi   Haryana
2    raju  12, ModelCol, Delhi, Haryana    12   ModelCol   Delhi   Haryana

In [2]:
df['Address'].values

array(['12, ModelCol, Delhi, Haryana', '12, ModelCol, Delhi, Haryana',
       '12, ModelCol, Delhi, Haryana'], dtype=object)

In [3]:
value

[['12', '12', '12'],
 [' ModelCol', ' ModelCol', ' ModelCol'],
 [' Delhi', ' Delhi', ' Delhi'],
 [' Haryana', ' Haryana', ' Haryana']]

In [4]:
pd.DataFrame(dic1)

    Names                       Address
0  ishaan  12, ModelCol, Delhi, Haryana
1    ravi  12, ModelCol, Delhi, Haryana
2    raju  12, ModelCol, Delhi, Haryana

In [5]:
import pandas as pd
import numpy as np

df = pd.read_csv("weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

#

2. Using df with a dictionary

- weather_data dictionary is data frame

In [6]:
import pandas as pd

weather_data = {
    
    'day' : ['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017'],
    'temperature' : [34, 44, 55, 66, 77, 26],
    'windspeed' : [6, 7, 2, 7, 4, 2],
    'event' : ['Rain', 'Sunny', 'Snow', 'Snow', 'Rain', 'Sunny']
}

df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           34          6   Rain
1  1/2/2017           44          7  Sunny
2  1/3/2017           55          2   Snow
3  1/4/2017           66          7   Snow
4  1/5/2017           77          4   Rain
5  1/6/2017           26          2  Sunny

#

- shape in df.shape means dimensions i.e. (total rows, total columns)

In [7]:
df.shape

(6, 4)

In [8]:
rows, columns = df.shape
print(rows,"\n")
print(columns)

6

4

####

- head in df.head() gives initial rows
- arguements from 0 to total number of rows can be given in place of n in df.head(n) to get a specified number of rows

In [9]:
df.head(3)

        day  temperature  windspeed  event
0  1/1/2017           34          6   Rain
1  1/2/2017           44          7  Sunny
2  1/3/2017           55          2   Snow

###

- df.tail() acts same as df.head, it just gives the (total - 1) last rows
- Arguements can also be given to get a specified number of last rows

In [10]:
df.tail(3)

        day  temperature  windspeed  event
3  1/4/2017           66          7   Snow
4  1/5/2017           77          4   Rain
5  1/6/2017           26          2  Sunny

###

#

###

### USING INDEXING AND SLICING IN DATAFRAME

#

Syntax:                  df[start_index : (end_index + 1)]

In [11]:
df[2:5]

        day  temperature  windspeed event
2  1/3/2017           55          2  Snow
3  1/4/2017           66          7  Snow
4  1/5/2017           77          4  Rain

#

- df.columns prints the number of columns

In [12]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

#

- df.column_name will print a particular column

- df.day == df['day']

In [13]:
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [14]:
df['event']

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

###

- Type of columns in our dataframe is type series

In [15]:
type(df['event'])

pandas.core.series.Series

###

- df[[column name #1, column name #2...]] will print particular columns together
- Great way of doing analysis

In [16]:
df[['event','day']]

   event       day
0   Rain  1/1/2017
1  Sunny  1/2/2017
2   Snow  1/3/2017
3   Snow  1/4/2017
4   Rain  1/5/2017
5  Sunny  1/6/2017

###

###

###

### OPERATIONS IN df

### Here's a link for rest of the pandas operations

https://pandas.pydata.org/docs/reference/api/pandas.Series.html

###

- max() :- df[column name].max() will give the max value in that column

- min() :- df[column name].min() will give the min value in that column

- mean() :- df[column name].mean() will give the average value of that column

- std() :- df[column name].std() will give the standard deviation value in that column

In [17]:
df['temperature'].max()

77

In [18]:
df['temperature'].min()

26

In [19]:
df['temperature'].mean()

50.333333333333336

###

- df.describe() will print the statastics of columns with integer data

In [20]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     50.333333   4.666667
std      19.376962   2.338090
min      26.000000   2.000000
25%      36.500000   2.500000
50%      49.500000   5.000000
75%      63.250000   6.750000
max      77.000000   7.000000

###

###

###

### CONDITIONAL STATEMENTS

###

- df[df.column_name_______], where _______ is condition

In [21]:
df[df.temperature>=45]

        day  temperature  windspeed event
2  1/3/2017           55          2  Snow
3  1/4/2017           66          7  Snow
4  1/5/2017           77          4  Rain

In [22]:
df[df.temperature == df.temperature.max()]

        day  temperature  windspeed event
4  1/5/2017           77          4  Rain

In [23]:
df[df.temperature == df["temperature"].max()]

        day  temperature  windspeed event
4  1/5/2017           77          4  Rain

In [24]:
df["day"][df.temperature == df["temperature"].max()]

4    1/5/2017
Name: day, dtype: object

In [25]:
df[["day","temperature"]][df.temperature == df["temperature"].max()]

        day  temperature
4  1/5/2017           77

###

###

###

### set_index() method

###

- df.index tells the index range
- df.set_index('column name') will change the specified column as index column
- df.set_index() gives a new data frame
- Inorder to make the new df as the default, we'll use inplace = True
- df.loc() will provide us with the values in a particular row
- df.reset_index will reset back the index to the original one

In [26]:
df

        day  temperature  windspeed  event
0  1/1/2017           34          6   Rain
1  1/2/2017           44          7  Sunny
2  1/3/2017           55          2   Snow
3  1/4/2017           66          7   Snow
4  1/5/2017           77          4   Rain
5  1/6/2017           26          2  Sunny

In [27]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [28]:
df.set_index('day', inplace=True)

In [29]:
df.set_index('temperature')

             windspeed  event
temperature
34                   6   Rain
44                   7  Sunny
55                   2   Snow
66                   7   Snow
77                   4   Rain
26                   2  Sunny

In [30]:
df

          temperature  windspeed  event
day
1/1/2017           34          6   Rain
1/2/2017           44          7  Sunny
1/3/2017           55          2   Snow
1/4/2017           66          7   Snow
1/5/2017           77          4   Rain
1/6/2017           26          2  Sunny

In [31]:
df.loc['1/3/2017']

temperature      55
windspeed         2
event          Snow
Name: 1/3/2017, dtype: object

In [32]:
df.reset_index(inplace=True)

In [33]:
df

        day  temperature  windspeed  event
0  1/1/2017           34          6   Rain
1  1/2/2017           44          7  Sunny
2  1/3/2017           55          2   Snow
3  1/4/2017           66          7   Snow
4  1/5/2017           77          4   Rain
5  1/6/2017           26          2  Sunny

In [34]:
df["new"] = df['temperature'] + df['windspeed']
df

        day  temperature  windspeed  event  new
0  1/1/2017           34          6   Rain   40
1  1/2/2017           44          7  Sunny   51
2  1/3/2017           55          2   Snow   57
3  1/4/2017           66          7   Snow   73
4  1/5/2017           77          4   Rain   81
5  1/6/2017           26          2  Sunny   28

In [35]:
df['Address'] = [{'hi', 'new', 'chess', 11, 12, 56}, {'hi', 'new', 'chess', 'new', 'lp', 'ml'}, {'hi', 'new', 'chess', 11, 12, 56}, {'hi', 'new', 'chess', 11, 12, 56}, {'hi', 'new', 'chess', 11, 12, 56}, {'hi', 'new', 'chess', 11, 12, 56}]

In [36]:
df

        day  temperature  windspeed  event  new                       Address
0  1/1/2017           34          6   Rain   40  {chess, hi, 56, 11, new, 12}
1  1/2/2017           44          7  Sunny   51      {chess, lp, ml, hi, new}
2  1/3/2017           55          2   Snow   57  {chess, hi, 56, 11, new, 12}
3  1/4/2017           66          7   Snow   73  {chess, hi, 56, 11, new, 12}
4  1/5/2017           77          4   Rain   81  {chess, hi, 56, 11, new, 12}
5  1/6/2017           26          2  Sunny   28  {chess, hi, 56, 11, new, 12}

In [37]:
cols = []
for i in df['Address'][1]:
    cols.append(i)
print(cols)

new_df = pd.DataFrame(columns=[cols])

['chess', 'lp', 'ml', 'hi', 'new']

In [38]:
new_df

Empty DataFrame
Columns: [(chess,), (lp,), (ml,), (hi,), (new,)]
Index: []

In [40]:
df = pd.DataFrame(pd.concat([df, new_df]), index=[1,2,3,4,5,6])
df

,day,temperature,windspeed,event,new,Address,"(chess,)","(lp,)","(ml,)","(hi,)","(new,)"
1,1/2/2017,44.0,7.0,Sunny,51.0,"{chess, lp, ml, hi, new}",NaN,NaN,NaN,NaN,NaN
2,1/3/2017,55.0,2.0,Snow,57.0,"{chess, hi, 56, 11, new, 12}",NaN,NaN,NaN,NaN,NaN
3,1/4/2017,66.0,7.0,Snow,73.0,"{chess, hi, 56, 11, new, 12}",NaN,NaN,NaN,NaN,NaN
4,1/5/2017,77.0,4.0,Rain,81.0,"{chess, hi, 56, 11, new, 12}",NaN,NaN,NaN,NaN,NaN
5,1/6/2017,26.0,2.0,Sunny,28.0,"{chess, hi, 56, 11, new, 12}",NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
df.drop("day", axis  = 1)

,temperature,windspeed,event,new,Address,"(ml,)","(chess,)","(lp,)","(new,)","(hi,)"
1,44.0,7.0,Sunny,51.0,"{ml, chess, lp, new, hi}",NaN,NaN,NaN,NaN,NaN
2,55.0,2.0,Snow,57.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
3,66.0,7.0,Snow,73.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
4,77.0,4.0,Rain,81.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
5,26.0,2.0,Sunny,28.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
df

,day,temperature,windspeed,event,new,Address,"(ml,)","(chess,)","(lp,)","(new,)","(hi,)"
1,1/2/2017,44.0,7.0,Sunny,51.0,"{ml, chess, lp, new, hi}",NaN,NaN,NaN,NaN,NaN
2,1/3/2017,55.0,2.0,Snow,57.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
3,1/4/2017,66.0,7.0,Snow,73.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
4,1/5/2017,77.0,4.0,Rain,81.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
5,1/6/2017,26.0,2.0,Sunny,28.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
df.drop([6], axis = 0)

,day,temperature,windspeed,event,new,Address,"(ml,)","(chess,)","(lp,)","(new,)","(hi,)"
1,1/2/2017,44.0,7.0,Sunny,51.0,"{ml, chess, lp, new, hi}",NaN,NaN,NaN,NaN,NaN
2,1/3/2017,55.0,2.0,Snow,57.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
3,1/4/2017,66.0,7.0,Snow,73.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
4,1/5/2017,77.0,4.0,Rain,81.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
5,1/6/2017,26.0,2.0,Sunny,28.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN

In [ ]:
df.replace([7.0,2.0], np.nan)

,day,temperature,windspeed,event,new,Address,"(ml,)","(chess,)","(lp,)","(new,)","(hi,)"
1,1/2/2017,44.0,NaN,Sunny,51.0,"{ml, chess, lp, new, hi}",NaN,NaN,NaN,NaN,NaN
2,1/3/2017,55.0,NaN,Snow,57.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
3,1/4/2017,66.0,NaN,Snow,73.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
4,1/5/2017,77.0,4.0,Rain,81.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
5,1/6/2017,26.0,NaN,Sunny,28.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
pd.read_csv("weather_data.csv", index_col = 0)

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [ ]:
df

,day,temperature,windspeed,event,new,Address,"(ml,)","(chess,)","(lp,)","(new,)","(hi,)"
1,1/2/2017,44.0,7.0,Sunny,51.0,"{ml, chess, lp, new, hi}",NaN,NaN,NaN,NaN,NaN
2,1/3/2017,55.0,2.0,Snow,57.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
3,1/4/2017,66.0,7.0,Snow,73.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
4,1/5/2017,77.0,4.0,Rain,81.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
5,1/6/2017,26.0,2.0,Sunny,28.0,"{chess, new, hi, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
df.drop(df.columns[1,2,3], axis = 1)

IndexError: too many indices for array: array is 1-dimensional, but 3 were indexed

In [ ]:
df.drop(df.columns[3], axis = 1)

,day,temperature,windspeed,new,Address,"(hi,)","(new,)","(chess,)","(lp,)","(ml,)"
1,1/2/2017,44.0,7.0,51.0,"{hi, new, chess, lp, ml}",NaN,NaN,NaN,NaN,NaN
2,1/3/2017,55.0,2.0,57.0,"{hi, new, chess, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
3,1/4/2017,66.0,7.0,73.0,"{hi, new, chess, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
4,1/5/2017,77.0,4.0,81.0,"{hi, new, chess, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
5,1/6/2017,26.0,2.0,28.0,"{hi, new, chess, 56, 11, 12}",NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
df.drop(df.columns[[1,2,3]], axis = 1)

,day,new,Address,"(hi,)","(chess,)","(ml,)","(new,)","(lp,)"
1,1/2/2017,51.0,"{hi, chess, ml, new, lp}",NaN,NaN,NaN,NaN,NaN
2,1/3/2017,57.0,"{hi, chess, 56, 11, 12, new}",NaN,NaN,NaN,NaN,NaN
3,1/4/2017,73.0,"{hi, chess, 56, 11, 12, new}",NaN,NaN,NaN,NaN,NaN
4,1/5/2017,81.0,"{hi, chess, 56, 11, 12, new}",NaN,NaN,NaN,NaN,NaN
5,1/6/2017,28.0,"{hi, chess, 56, 11, 12, new}",NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
new = {"Address": ['Chitkara, HP, Me','Chitkara, Rajpura, U']}

{'Address': ['Chitkara, HP, Me', 'Chitkara, Rajpura, U']}

In [ ]:
new = {"Address": ['Chitkara, HP, Me','Chitkara, Rajpura, U']}

                Address
0      Chitkara, HP, Me
1  Chitkara, Rajpura, U

In [ ]:
df[['Place', 'Area', 'Pep']] = df['Address'].str.split(",", expand = True)
new1 = df.drop('Address', axis=1)
new1

      Place      Area  Pep
0  Chitkara        HP   Me
1  Chitkara   Rajpura    U

In [ ]:
new1.to_csv("new1.csv")

In [ ]:
pd.read_csv("new1.csv", index_col=1)

          Unnamed: 0      Area  Pep
Place
Chitkara           0        HP   Me
Chitkara           1   Rajpura    U

In [ ]:
len(df['Address'][0].split(","))

3

In [ ]:
df['Address'][0].split()

['Chitkara,', 'HP,', 'Me']